cases/OpenFOAM/verificationAndValidation/multiphase/interIsoFoam/porousDamBreak/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interIsoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         4;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.4;
maxAlphaCo      0.4;

maxDeltaT       1;

functions
{
    freeSurface
    {
        type            surfaces;
        libs            (sampling);
        interpolationScheme cell;
        writeControl    writeTime;
        writeInterval   1;
        surfaceFormat   raw;

        fields
        (
            alpha.water
        );

        surfaces
        {
            freeSurface
            {
                type        isoSurfaceCell;
                isoField    alpha.water;
                isoValue    0.5;
                interpolate false;
                regularise  false;
            }

            alpha_001
            {
                type        isoSurfaceCell;
                isoField    alpha.water;
                isoValue    0.01;
                interpolate false;
                regularise  false;
            }

            alpha_099
            {
                type        isoSurfaceCell;
                isoField    alpha.water;
                isoValue    0.99;
                interpolate false;
                regularise  false;
            }
        }
    }
}


// ************************************************************************* //
